# /usr/bin/python3.7
# quiz.py - создаёт билеты с вопросами и ответами, расположенными в случайном порядке, вместе с ключами ответов

import random
# Данные билетов: ключи - названия регионов, а значения - столицы
capitals = {"Адыгея": "Майкоп", "Алтайский край": "Барнаул", "Амурская область": "Благовещенск",
            "Архангельская область": "Архангельск", "Астраханская область": "Астрахань", "Башкортостан": "Уфа",
            "Белгородская область": "Белгород", "Брянская область": "Брянск", "Бурятия": "Улан-Удэ",
            "Владимирская область": "Владимир", "Волгоградская область": "Волгоград", "Вологодская область": "Вологда",
            "Воронежская область": "Воронеж", "Дагестан": "Махачкала", "Еврейская автономная область": "Биробиджан",
            "Забайкальский край": "Чита", "Ивановская область": "Иваново", "Ингушетия": "Магас",
            "Иркутская область": "Иркутск", "Кабардино-Балкария": "Нальчик", "Калининградская область": "Калининград",
            "Калмыкия": "Элиста", "Калужская область": "Калуга", "Камчатский край": "Петропавловск-Камчатский",
            "Карачаево-Черкесия": "Черкесск", "Карелия": "Петрозаводск", "Кемеровская область": "Кемерово",
            "Кировская область": "Киров", "Костромская область": "Кострома", "Краснодарский край": "Краснодар",
            "Красноярский край": "Красноярск", "Курганская область": "Курган", "Курская область": "Курск",
            "Ленинградская область": "Гатчина", "Липецкая область": "Липецк", "Магаданская область": "Магадан",
            "Марий-Эл": "Йошкар-Ола", "Мордовия": "Саранск", "Москва": "Москва", "Московская область": "Красногорск",
            "Мурманская область": "Мурманск", "Ненецкий автономный округ": "Нарьян-Мар",
            "Нижегородская область": "Нижний Новгород", "Новгородская область": "Великий Новгород",
            "Новосибирская область": "Новосибирск", "Омская область": "Омск", "Оренбургская область": "Оренбург",
            "Орловская область": "Орёл", "Пензенская область": "Пенза", "Пермский край": "Пермь",
            "Приморский край": "Владивосток", "Псковская область": "Псков", "Республика Алтай": "Горно-Алтайск",
            "Республика Коми": "Сыктывкар", "Республика Крым": "Симферополь", "Ростовская область": "Ростов-на-Дону",
            "Рязанская область": "Рязань", "Самарская область": "Самара", "Санкт-Петербург": "Санкт-Петербург",
            "Саратовская область": "Саратов", "Сахалинская область": "Южно-Сахалинск",
            "Свердловская область": "Екатеринбург", "Севастополь": "Севастополь", "Северная Осетия": "Владикавказ",
            "Смоленская область": "Смоленск", "Ставропольский край": "Ставрополь", "Тамбовская область": "Тамбов",
            "Татарстан": "Казань", "Тверская область": "Тверь", "Томская область": "Томск", "Тульская область": "Тула",
            "Тыва": "Кызыл", "Тюменская область": "Тюмень", "Удмуртия": "Ижевск", "Ульяновская область": "Ульяновск",
            "Хабаровский край": "Хабаровск", "Хакасия": "Абакан",
            "Ханты-Мансийский автономный округ - Югра": "Ханты-Мансийск", "Челябинская область": "Челябинск",
            "Чечня": "Грозный", "Чувашия": "Чебоксары", "Чукотский автономный округ": "Анадырь", "Якутия": "Якутск",
            "Ямало-Ненецкий автономный округ": "Салехард", "Ярославская область": "Ярославль"}

# Генерирования 35 файлов билетов
for quiz_num in range(35):
    # Создание файлов билетов и ключей ответов
    quiz_file = open(f"Викторина по столицам {quiz_num + 1}.txt", "w")
    answer_key_file = open(f"Викторина по столицам - ответы {quiz_num + 1}.txt", "w")

    # Запись заголовка билета
    quiz_file.write("Имя:\n\nДата:\n\nГруппа:\n\n")
    quiz_file.write(f"Столицы регионов (билет {quiz_num + 1})")
    quiz_file.write("\n\n")

    # Перемешивание порядка следования регионов
    regions = list(capitals.keys())
    random.shuffle(regions)

    # Организация цикла по всем регионам и создание вопроса для каждого из них
    for question_num in range(85):
        # Получение правильных и неправильных ответов
        correct_answer = capitals[regions[question_num]]
        wrong_answers = list(capitals.values())
        del wrong_answers[wrong_answers.index(correct_answer)]
        wrong_answers = random.sample(wrong_answers, 3)
        answer_options = wrong_answers + [correct_answer]
        random.shuffle(answer_options)

        # Запись вариантов вопросов и ответов в файл билета
        quiz_file.write(f"{question_num + 1}. Выберите столицу региона {regions[question_num]}.\n")
        for i in range(4):
            quiz_file.write(f"{'АБВГ'[i]}. {answer_options[i]}\n")
            quiz_file.write("\n")
        # Запись ключа ответа в файл
        answer_key_file.write(f"{question_num + 1}. {'АБВГ'[answer_options.index(correct_answer)]}\n")
    quiz_file.close()
    answer_key_file.close()
