import random

print("Давайте играть в угадайку слов!")


def get_word():
    football_clubs = ["Аякс", "Барселона", "Бенфика", "Бавария", "Вердер", "Валенсия", "Гамбург",
                      "Галатасарай", "Динамо", "Зенит", "Интер", "Копенгаген", "Коринтианс",
                      "Ливерпуль", "Лацио", "Локомотив", "Милан", "Малага", "Наполи", "Нюрнберг",
                      "Порту", "Палмейрас", "Палермо", "Рома", "Севилья", "Спартак", "Селтик",
                      "Торпедо", "Тоттенхэм", "Удинезе", "Уотфорд", "Фенербахче", "Фиорентина",
                      "Фулхэм", "Челси", "Шальке", "Штутгард", "Эвертон", "Эльче", "Ювентус"]
    wall_items = ["Вешалка", "Гардина", "Зеркало", "Икона", "Картина", "Ковёр", "Календарь",
                    "Лампа", "Портрет", "Полка", "Рисунок", "Телевизор", "Фотография", "Часы",]
    pocket_items = ["Билет", "Деньги", "Документы", "Жетон", "Ключи", "Кошелёк", "Монета", "Телефон"]
    sport = ["Бадминтон", "Баскетбол", "Биатлон", "Бобслей", "Бокс", "Борьба", "Велоспорт",
             "Волейбол", "Гандбол", "Гимнастика", "Гольф", "Гребля", "Дзюдо", "Кёрлинг",
             "Плавание", "Регби", "Сёрфинг", "Скейтбординг", "Сноуборд", "Стрельба",
             "Теннис", "Триатлон", "Тхэквондо", "Фехтование", "Фристайл", "Футбол", "Хоккей"]
    bathroom_items = ["Аптечка", "Бальзам", "Ведро", "Йод", "Коврик", "Ковш", "Мыло", "Мочалка",
                      "Полотенце", "Расчёска", "Тапочки", "Фен", "Халат", "Шампунь", "Щётка"]
    russian_cities = ["Майкоп", "Уфа", "Махачкала", "Магас", "Нальчик", "Элиста", "Черкесск", "Петрозаводск",
                      "Сыктывкар", "Саранск", "Якутск", "Владикавказ", "Казань", "Кызыл", "Ижевск",
                      "Абакан", "Грозный", "Чебоксары", "Симферополь", "Барнаул", "Чита", "Краснодар",
                      "Красноярск", "Пермь", "Владивосток", "Ставрополь", "Хабаровск", "Благовещенск",
                      "Архангельск", "Астрахань", "Белгород", "Брянск", "Владимир", "Волгоград", "Вологда",
                      "Воронеж", "Иваново", "Иркутск", "Калининград", "Калуга", "Кемерово", "Киров",
                      "Кострома", "Курган", "Курск", "Липецк", "Магадан", "Москва", "Мурманск", "Новосибирск",
                      "Омск", "Оренбург", "Орёл", "Пенза", "Псков", "Рязань", "Самара", "Саратов",
                      "Екатеринбург", "Смоленск", "Тамбов", "Тверь", "Томск", "Тула", "Тюмень", "Ульяновск",
                      "Челябинск", "Ярославль", "Севастополь", "Биробиджан", "Анадырь", "Салехард"]
    female_names = ["Анна", "Анастасия", "Алиса", "Анфиса", "Алиса", "Алла", "Антонина", "Александра", "Василиса",
                    "Галина", "Дарья", "Диана", "Елена", "Евгения", "Жанна", "Ксения", "Любовь", "Людмила",
                    "Лариса", "Мария", "Надежда", "Ольга", "Полина", "Светлана", "Тамара", "Юлия"]
    male_names = ["Александр", "Алексей", "Борис", "Василий", "Виталий", "Геннадий", "Григорий", "Денис",
                  "Дмитрий", "Егор", "Игорь", "Иван", "Кирилл", "Константин", "Михаил", "Максим", "Никита",
                  "Николай", "Олег", "Пётр", "Павел", "Роман", "Руслан", "Семён", "Сергей", "Юрий"]
    furniture = ["Вешалка", "Диван", "Зеркало", "Кресло", "Кровать", "Комод", "Люстра"
                 "Полка", "Стул", "Стол", "Сервант", "Стеллаж", "Табурет", "Тумба", "Шкаф"]
    musical_instrument = ["Арфа", "Аккордеон", "Баян", "Балалайка", "Барабан", "Бубен", "Волынка", "Гитара",
                          "Маракасы", "Орган", "Пианино", "Рояль", "Скрипка", "Синтезатор", "Саксофон", "Фортепьяно"]
    drinks = ["Абсент", "Вода", "Вино", "Виски", "Глинтвейн", "Дюшес", "Кисель", "Коктейль", "Кофе", "Квас",
              "Кефир", "Лимонад", "Морс", "Молоко", "Пиво", "Сироп", "Сок", "Текила", "Тархун", "Чай"]
    profession = ["Агроном", "Бухгалтер", "Врач", "Геолог", "Дизайнер", "Журналист", "Инженер",
                  "Композитор", "Машинист", "Пилот", "Повар", "Психолог", "Программист",
                  "Строитель", "Учитель", "Хирург", "Электрик", "Экономист", "Юрист"]
    countries = ["Австралия", "Австрия", "Албания", "Азербайджан", "Алжир", "Ангола", "Андорра", "Афганистан",
                 "Аргентина", "Армения", "Бангладеш", "Беларусь", "Бельгия", "Бенин", "Болгария", "Боливия",
                 "Бразилия", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гана",
                 "Гватемала", "Германия", "Гвинея", "Гондурас", "Греция", "Грузия", "Дания", "Египет", "Иран",
                 "Ирак", "Иордания", "Ирландия", "Испания", "Италия", "Индонезия", "Индия", "Израиль", "Йемен",
                 "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кипр", "Кения", "Киргизия", "Китай",
                 "Колумбия", "Куба", "Кувейт", "Латвия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксемубрг",
                 "Мадагаскар", "Малайзия", "Мали", "Мальта", "Марокко", "Монако", "Мексика", "Монголия", "Молдова",
                 "Непал", "Нигер", "Нигерия", "Нидерланды", "Норвегия", "Оман", "Пакистан", "Панама", "Парагвай",
                 "Перу", "Польша", "Португалия", "Россия", "Румыния", "Сенегал", "Сербия", "Сингапур", "Сирия",
                 "Словакия", "Словения", "США", "Таджикистан", "Таиланд", "Туркменистан", "Турция", "Тунис",
                 "Украина", "Уругвай", "Узбекистан", "Филиппины", "Франция", "Финляндия", "Хорватия", "Черногория",
                 "Чили", "Чехия", "Швейцария", "Швеция", "Эквадор", "Эстония", "Эфиопия", "Япония", "Ямайка"]
    periodic_table = ["Водород", "Гелий", "Литий", "Бериллий", "Бор", "Углерод", "Азот", "Кислород", "Фтор",
                      "Неон", "Натрий", "Магний", "Алюминий", "Кремний", "Фосфор", "Сера", "Хлор", "Аргон",
                      "Калий", "Кальций", "Скандий", "Титан", "Ванадий", "Хром", "Марганец", "Железо", "Кобальт",
                      "Никель", "Медь", "Цинк", "Галлий", "Германий", "Мышьяк", "Селен", "Бром", "Криптон",
                      "Рубидий", "Стронций", "Иттрий", "Цирконий", "Ниобий", "Молибден", "Технеций", "Рутений",
                      "Родий", "Палладий", "Серебро", "Кадмий", "Индий", "Олово", "Сурьма", "Теллур", "Иод",
                      "Ксенон", "Цезий", "Барий", "Лантан", "Церий", "Празеодим", "Неодим", "Прометий", "Самарий",
                      "Европий", "Гадолиний", "Тербий", "Диспрозий", "Гольмий", "Эрбий", "Тулий", "Иттербий",
                      "Лютеций", "Гафний", "Тантал", "Вольфрам", "Рений", "Осмий", "Иридий", "Платина", "Золото",
                      "Ртуть", "Таллий", "Свинец", "Висмут", "Полоний", "Астат", "Радон", "Франций", "Радий",
                      "Актиний", "Торий", "Протактиний", "Уран", "Нептуний", "Плутоний", "Америций", "Кюрий",
                      "Берклий", "Калифорний", "Эйнштейний", "Фермий", "Менделевий", "Нобелий", "Лоуренсий",
                      "Резерфордий", "Дубний", "Сиборгий", "Борий", "Хассий", "Мейтнерий", "Дармштадий", "Рентгений",
                      "Коперниций", "Нихоний", "Флеровий", "Московий", "Ливерморий", "Теннессин", "Оганесон"]
    all_list = [football_clubs, wall_items, pocket_items, sport, bathroom_items, russian_cities, female_names,
                male_names, furniture, musical_instrument, drinks, profession, countries, periodic_table]
    any = random.choice(all_list)
    return random.choice(any)


def display_hangman(tries):
    stages = ['''
--------
|      |
|      0
|     \\|/
|      |
|     / \\
-
              ''',
              '''
--------
|      |
|      0
|     \\|/
|      |
|     /
-
              ''',
              '''
--------
|      |
|      0
|     \\|/
|      |
|
-
              ''',
              '''
--------
|      |
|      0
|     \\|
|      |
|
-
              ''',
              '''
--------
|      |
|      0
|      |
|      |
|
-
              ''',
              '''
--------
|      |
|      0
|
|
|
-
              ''',
              '''
--------
|      |
|
|
|
|
-
              ''']
    return stages[tries]


def check_category(word):
    football_clubs = ["Аякс", "Барселона", "Бенфика", "Бавария", "Вердер", "Валенсия", "Гамбург",
                      "Галатасарай", "Динамо", "Зенит", "Интер", "Копенгаген", "Коринтианс",
                      "Ливерпуль", "Лацио", "Локомотив", "Милан", "Малага", "Наполи", "Нюрнберг",
                      "Порту", "Палмейрас", "Палермо", "Рома", "Севилья", "Спартак", "Селтик",
                      "Торпедо", "Тоттенхэм", "Удинезе", "Уотфорд", "Фенербахче", "Фиорентина",
                      "Фулхэм", "Челси", "Шальке", "Штутгард", "Эвертон", "Эльче", "Ювентус"]
    wall_items = ["Вешалка", "Гардина", "Зеркало", "Икона", "Картина", "Ковёр", "Календарь",
                  "Лампа", "Портрет", "Полка", "Рисунок", "Телевизор", "Фотография", "Часы", ]
    pocket_items = ["Билет", "Деньги", "Документы", "Жетон", "Ключи", "Кошелёк", "Монета", "Телефон"]
    sport = ["Бадминтон", "Баскетбол", "Биатлон", "Бобслей", "Бокс", "Борьба", "Велоспорт",
             "Волейбол", "Гандбол", "Гимнастика", "Гольф", "Гребля", "Дзюдо", "Кёрлинг",
             "Плавание", "Регби", "Сёрфинг", "Скейтбординг", "Сноуборд", "Стрельба",
             "Теннис", "Триатлон", "Тхэквондо", "Фехтование", "Фристайл", "Футбол", "Хоккей"]
    bathroom_items = ["Аптечка", "Бальзам", "Ведро", "Йод", "Коврик", "Ковш", "Мыло", "Мочалка",
                      "Полотенце", "Расчёска", "Тапочки", "Фен", "Халат", "Шампунь", "Щётка"]
    russian_cities = ["Майкоп", "Уфа", "Махачкала", "Магас", "Нальчик", "Элиста", "Черкесск", "Петрозаводск",
                      "Сыктывкар", "Саранск", "Якутск", "Владикавказ", "Казань", "Кызыл", "Ижевск",
                      "Абакан", "Грозный", "Чебоксары", "Симферополь", "Барнаул", "Чита", "Краснодар",
                      "Красноярск", "Пермь", "Владивосток", "Ставрополь", "Хабаровск", "Благовещенск",
                      "Архангельск", "Астрахань", "Белгород", "Брянск", "Владимир", "Волгоград", "Вологда",
                      "Воронеж", "Иваново", "Иркутск", "Калининград", "Калуга", "Кемерово", "Киров",
                      "Кострома", "Курган", "Курск", "Липецк", "Магадан", "Москва", "Мурманск", "Новосибирск",
                      "Омск", "Оренбург", "Орёл", "Пенза", "Псков", "Рязань", "Самара", "Саратов",
                      "Екатеринбург", "Смоленск", "Тамбов", "Тверь", "Томск", "Тула", "Тюмень", "Ульяновск",
                      "Челябинск", "Ярославль", "Севастополь", "Биробиджан", "Анадырь", "Салехард"]
    female_names = ["Анна", "Анастасия", "Алиса", "Анфиса", "Алиса", "Алла", "Антонина", "Александра", "Василиса",
                    "Галина", "Дарья", "Диана", "Елена", "Евгения", "Жанна", "Ксения", "Любовь", "Людмила",
                    "Лариса", "Мария", "Надежда", "Ольга", "Полина", "Светлана", "Тамара", "Юлия"]
    male_names = ["Александр", "Алексей", "Борис", "Василий", "Виталий", "Геннадий", "Григорий", "Денис",
                  "Дмитрий", "Егор", "Игорь", "Иван", "Кирилл", "Константин", "Михаил", "Максим", "Никита",
                  "Николай", "Олег", "Пётр", "Павел", "Роман", "Руслан", "Семён", "Сергей", "Юрий"]
    furniture = ["Вешалка", "Диван", "Зеркало", "Кресло", "Кровать", "Комод", "Люстра"
                 "Полка", "Стул", "Стол", "Сервант", "Стеллаж", "Табурет", "Тумба", "Шкаф"]
    musical_instrument = ["Арфа", "Аккордеон", "Баян", "Балалайка", "Барабан", "Бубен", "Волынка", "Гитара",
                          "Маракасы", "Орган", "Пианино", "Рояль", "Скрипка", "Синтезатор", "Саксофон", "Фортепьяно"]
    drinks = ["Абсент", "Вода", "Вино", "Виски", "Глинтвейн", "Дюшес", "Кисель", "Коктейль", "Кофе", "Квас",
              "Кефир", "Лимонад", "Морс", "Молоко", "Пиво", "Сироп", "Сок", "Текила", "Тархун", "Чай"]
    profession = ["Агроном", "Бухгалтер", "Врач", "Геолог", "Дизайнер", "Журналист", "Инженер",
                  "Композитор", "Машинист", "Пилот", "Повар", "Психолог", "Программист",
                  "Строитель", "Учитель", "Хирург", "Электрик", "Экономист", "Юрист"]
    countries = ["Австралия", "Австрия", "Албания", "Азербайджан", "Алжир", "Ангола", "Андорра", "Афганистан",
                 "Аргентина", "Армения", "Бангладеш", "Беларусь", "Бельгия", "Бенин", "Болгария", "Боливия",
                 "Бразилия", "Ватикан", "Великобритания", "Венгрия", "Венесуэла", "Вьетнам", "Габон", "Гана",
                 "Гватемала", "Германия", "Гвинея", "Гондурас", "Греция", "Грузия", "Дания", "Египет", "Иран",
                 "Ирак", "Иордания", "Ирландия", "Испания", "Италия", "Индонезия", "Индия", "Израиль", "Йемен",
                 "Казахстан", "Камбоджа", "Камерун", "Канада", "Катар", "Кипр", "Кения", "Киргизия", "Китай",
                 "Колумбия", "Куба", "Кувейт", "Латвия", "Ливан", "Ливия", "Литва", "Лихтенштейн", "Люксемубрг",
                 "Мадагаскар", "Малайзия", "Мали", "Мальта", "Марокко", "Монако", "Мексика", "Монголия", "Молдова",
                 "Непал", "Нигер", "Нигерия", "Нидерланды", "Норвегия", "Оман", "Пакистан", "Панама", "Парагвай",
                 "Перу", "Польша", "Португалия", "Россия", "Румыния", "Сенегал", "Сербия", "Сингапур", "Сирия",
                 "Словакия", "Словения", "США", "Таджикистан", "Таиланд", "Туркменистан", "Турция", "Тунис",
                 "Украина", "Уругвай", "Узбекистан", "Филиппины", "Франция", "Финляндия", "Хорватия", "Черногория",
                 "Чили", "Чехия", "Швейцария", "Швеция", "Эквадор", "Эстония", "Эфиопия", "Япония", "Ямайка"]
    periodic_table = ["Водород", "Гелий", "Литий", "Бериллий", "Бор", "Углерод", "Азот", "Кислород", "Фтор",
                      "Неон", "Натрий", "Магний", "Алюминий", "Кремний", "Фосфор", "Сера", "Хлор", "Аргон",
                      "Калий", "Кальций", "Скандий", "Титан", "Ванадий", "Хром", "Марганец", "Железо", "Кобальт",
                      "Никель", "Медь", "Цинк", "Галлий", "Германий", "Мышьяк", "Селен", "Бром", "Криптон",
                      "Рубидий", "Стронций", "Иттрий", "Цирконий", "Ниобий", "Молибден", "Технеций", "Рутений",
                      "Родий", "Палладий", "Серебро", "Кадмий", "Индий", "Олово", "Сурьма", "Теллур", "Иод",
                      "Ксенон", "Цезий", "Барий", "Лантан", "Церий", "Празеодим", "Неодим", "Прометий", "Самарий",
                      "Европий", "Гадолиний", "Тербий", "Диспрозий", "Гольмий", "Эрбий", "Тулий", "Иттербий",
                      "Лютеций", "Гафний", "Тантал", "Вольфрам", "Рений", "Осмий", "Иридий", "Платина", "Золото",
                      "Ртуть", "Таллий", "Свинец", "Висмут", "Полоний", "Астат", "Радон", "Франций", "Радий",
                      "Актиний", "Торий", "Протактиний", "Уран", "Нептуний", "Плутоний", "Америций", "Кюрий",
                      "Берклий", "Калифорний", "Эйнштейний", "Фермий", "Менделевий", "Нобелий", "Лоуренсий",
                      "Резерфордий", "Дубний", "Сиборгий", "Борий", "Хассий", "Мейтнерий", "Дармштадий", "Рентгений",
                      "Коперниций", "Нихоний", "Флеровий", "Московий", "Ливерморий", "Теннессин", "Оганесон"]
    word = word.capitalize()
    if word in football_clubs:
        hint = "Футбольный клуб"
        return hint
    elif word in wall_items:
        hint = "Настенный предмет"
        return hint
    elif word in pocket_items:
        hint = "Карманный предмет"
        return hint
    elif word in sport:
        hint = "Вид спорта"
        return hint
    elif word in bathroom_items:
        hint = "Обычно находится в ванной комнате"
        return hint
    elif word in russian_cities:
        hint = "Город в России"
        return hint
    elif word in female_names:
        hint = "Женское имя"
        return hint
    elif word in male_names:
        hint = "Мужское имя"
        return hint
    elif word in furniture:
        hint = "Предмет мебели"
        return hint
    elif word in musical_instrument:
        hint = "Музыкальный инструмент"
        return hint
    elif word in drinks:
        hint = "Напиток (в том числе алкогольный)"
        return hint
    elif word in profession:
        hint = "Профессия"
        return hint
    elif word in countries:
        hint = "Страна"
        return hint
    elif word in periodic_table:
        hint = "Элемент периодической таблицы Менделеева"
        return hint


def play(word):
    hint = check_category(word)
    word = [e for e in word]
    word_completion = ["_"] * len(word)
    guessed_letters = []
    guessed_word = []
    tries = 6
    first_last_letters = input("Отобразить первую и последнюю буквы? (да/нет)\n")
    while first_last_letters.lower() != "да" and first_last_letters.lower() != "нет":
        first_last_letters = input("Некорректный ответ. Отобразить первую и последнюю буквы? (да/нет)\n")
    if first_last_letters.lower() == "да":
        word_completion[0] = word[0]
        word_completion[-1] = word[-1]
    show_hint = input("Отобразить подсказку? (да/нет)\n")
    while show_hint.lower() != "да" and first_last_letters.lower() != "нет":
        show_hint = input("Некорректный ответ. Отобразить подсказку? (да/нет)\n")
    while tries != 0:
        guessed = False
        print(display_hangman(tries))
        if show_hint.lower() == "да":
            print(f"Подсказка: {hint}")
        print(*word_completion)
        in_try = input("Введите букву или слово(русского алфавита):\n")
        while not in_try:
            in_try = input("Неправильно. Введите букву русского алфавита:\n")
        in_try = in_try.upper()
        while True:
            for e in in_try:
                if e not in "АБВГДЕЁЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ":
                    in_try = input("Неправильно. Введите букву русского алфавита:\n")
                    in_try = in_try.upper()
                else:
                    guessed = True
            if guessed:
                break
        while in_try in guessed_letters:
            in_try = input("Такая буква уже была. Попробуйте другую:\n")
            in_try = in_try.upper()
        while in_try in guessed_word:
            in_try = input("Такое слово уже было. Попробуйте другое:\n")
            in_try = in_try.upper()
        while not in_try:
            in_try = input("Вы ничего не ввели. Попробуйте ещё раз:\n")
            in_try = in_try.upper()
        if len(in_try) == 1:
            if in_try in word:
                for i in range(len(word)):
                    if word[i] == in_try:
                        word_completion[i] = in_try
                guessed_letters.append(in_try)
                if "_" not in word_completion:
                    print("Поздравляем, вы угадали слово! Вы победили!")
                    break
            else:
                print("К сожалению, такой буквы нет!")
                tries -= 1
                guessed_letters.append(in_try)
        else:
            in_try = [e for e in in_try]
            if len(in_try) != len(word):
                print("Длина вашего слова не равна длине загаданного.")
                continue
            if in_try == word:
                print("Поздравляем, вы угадали слово! Вы победили!")
                break
            else:
                print("К сожалению, неправильно.")
                guessed_word.append(in_try)
                tries -= 1
    if tries == 0:
        print("Вы проиграли.")
    print(display_hangman(tries))
    print(*word)


while True:
    play(get_word().upper())
    ask = input("Играем ещё раз? (да/нет)\n")
    while ask.lower() != "да" and ask.lower() != "нет":
        ask = "Некорректный ответ. Играем ещё раз? (да/нет)\n"
    if ask == "нет":
        break
